# 데이터프레임의 데이터 조작

In [1]:
import numpy as np
import pandas as pd

### 데이터 갯수 세기

In [2]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [3]:
s.count()

9

In [4]:
np.random.seed(2020)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  3.0
1  3.0  3.0  0.0  0.0
2  0.0  0.0  2.0  NaN
3  3.0  3.0  2.0  3.0

In [5]:
# 열단위로 개수가 세어진다.
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [6]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [7]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

### 카테고리 값 세기 (Category. 범주형)

In [11]:
# 범주형이란?
# 데이터값이 지정되어있는 것을 말한다.
# Ex.남/여, 1호,2호,3호...

In [12]:
np.random.seed(2020)
s2 = pd.Series(np.random.randint(6, size=100))
s2.tail()

95    5
96    5
97    5
98    2
99    2
dtype: int32

In [13]:
s2.value_counts()

0    20
3    18
2    17
1    17
5    16
4    12
dtype: int64

In [14]:
# 데이터프레임이라면 열마다 각각 지정해서 확인해야한다.
df[0].value_counts()

3.0    2
0.0    2
Name: 0, dtype: int64

### 정렬

In [15]:
# sort_index 메서드는 인덱스 값을 기준으로 정렬
# sort_values 메서드는 데이터 값을 기준으로 정렬

In [16]:
# 0~5에 관하여 몇개가나오는것인가 (0~5 순서대로 정렬)
s2.value_counts().sort_index()

0    20
1    17
2    17
3    18
4    12
5    16
dtype: int64

In [17]:
# NaN이 있는경우에는 NaN이 제일 뒤로간다.
s.sort_values()

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

In [18]:
# 오름차순이 아닌 내림차순으로 하고싶을때
# numpy에서는 sort()[::-1]로 해야한다. (오름차순 정렬밖에 없어서)
s.sort_values(ascending=False)

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

In [19]:
# by를 통하여 기준이 되는 열을 정해 줄 수 있다.
# 기준이 되는 열의 오름차순으로 정렬이 된다.
# sql의 ORDER BY와 같은 의미
df.sort_values(by=1)

     0    1    2    3
0  0.0  0.0  3.0  3.0
2  0.0  0.0  2.0  NaN
1  3.0  3.0  0.0  0.0
3  3.0  3.0  2.0  3.0

In [25]:
# 연습문제 4.4.2
# sort_values 메서드를 사용하여 타이타닉호 승객에 대해 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.

titanic["sex"].value_counts()
titanic["age"].value_counts()
titanic["class"].value_counts()
titanic["alive"].value_counts()

no     549
yes    342
Name: alive, dtype: int64

### 행/열 합계

In [26]:
np.random.seed(2020)
df2 = pd.DataFrame(np.random.randint(10, size=(4, 8)))
df2

   0  1  2  3  4  5  6  7
0  0  8  3  6  3  3  7  8
1  0  0  8  9  3  7  2  3
2  6  5  0  4  8  6  4  1
3  1  5  9  5  6  6  6  5

In [28]:
df2.sum(axis=1)

0    38
1    32
2    34
3    43
dtype: int64

In [29]:
df2.sum(axis=0)

0     7
1    18
2    20
3    24
4    20
5    22
6    19
7    17
dtype: int64

In [31]:
# sum한 결과를 rowsum에 저장
df2['RowSum'] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  RowSum
0  0  8  3  6  3  3  7  8      76
1  0  0  8  9  3  7  2  3      64
2  6  5  0  4  8  6  4  1      68
3  1  5  9  5  6  6  6  5      86

In [32]:
df2.loc['ColTotal', :] = df2.sum()
df2

            0     1     2     3     4     5     6     7  RowSum
0         0.0   8.0   3.0   6.0   3.0   3.0   7.0   8.0    76.0
1         0.0   0.0   8.0   9.0   3.0   7.0   2.0   3.0    64.0
2         6.0   5.0   0.0   4.0   8.0   6.0   4.0   1.0    68.0
3         1.0   5.0   9.0   5.0   6.0   6.0   6.0   5.0    86.0
ColTotal  7.0  18.0  20.0  24.0  20.0  22.0  19.0  17.0   294.0

In [84]:
# 연습문제 4.4.3
# 1. 타이타닉호 승객의 평균 나이를 구하라.
round(titanic["age"].mean(),2)

29.7

In [92]:
# 2.타이타닉호 승객중 여성 승객의 평균 나이를 구하라.
print(round(titanic[titanic["sex"].isin(["female"])].age.mean(),2))
print(titanic[titanic.sex == "female"].age.mean())
# t2 = titanic[titanic["sex"] == 'female']
# round(t2["age"].mean(),2)

27.92
27.915708812260537

In [95]:
# 3. 타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.
round(titanic[titanic["class"].isin(["First"]) & titanic["sex"].isin(["female"])].age.mean(),2)

34.61

### apply 변환

In [96]:
# 행이나 열 단위로 더 복잡한 처리를 하고 싶을 때는 apply 메서드를 사용
# 인수로 행 또는 열을 받는 함수를 apply 메서드의 인수로 넣으면 각 열(또는 행)을 반복하여 그 함수에 적용
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [97]:
df3.apply(lambda x: x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [98]:
# 행에 대해 적용할때에는 axis=1을 적어준다.
df3.apply(lambda x: x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [99]:
# 각 열에 대해 어떤 값이 얼마나 사용되었는지 확인
df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [100]:
titanic["adult/child"] = titanic.apply(lambda r: "adult" if r.age >= 20 else "child", axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

In [102]:
# 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만들어라. category1 카테고리는 다음과 같이 정의된다.
# 1. 20살이 넘으면 성별을 그대로 사용한다.
# 2. 20살 미만이면 성별에 관계없이 “child”라고 한다.
titanic["category1"] = titanic.apply(lambda r: r.sex if r.age>=20 else "child", axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult,male

### fillna 메서드

In [103]:
# NaN 값은 fillna 메서드를 사용하여 원하는 값으로 바꿀 수 있다.
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [104]:
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [112]:
# 연습문제 4.4.5
# 타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고쳐라.

titanic['age'] = round(titanic['age'].fillna(titanic['age'].mean()),3)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,child
888,0,3,female,29.7,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult,male

### astype 메서드

In [113]:
# 전체 데이터의 자료형을 바꾸기
df3.apply(pd.value_counts).fillna(0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [114]:
# 타입을 인트로 주면 전체적으로 int타입으로 바뀐다.
df3.apply(pd.value_counts).fillna(0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

In [121]:
# 연습문제 4.4.6
# 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category2 열을 만들어라. category2 카테고리는 다음과 같이 정의된다.
# 1. 성별을 나타내는 문자열 male 또는 female로 시작한다.
# 2. 성별을 나타내는 문자열 뒤에 나이를 나타내는 문자열이 온다.
# 3. 예를 들어 27살 남성은 male27 값이 된다.

titanic["category2"] = titanic['sex']+titanic['age'].astype(int).astype(str)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1,category2
886,0,2,male,27,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult,male,male27
887,1,1,female,19,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,child,female19
888,0,3,female,29,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,child,female29
889,1,1,male,26,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult,male,male26
890,0,3,male,32,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult,male,male32

### 실수 값을 카테고리 값으로 변환

In [126]:
ages = [0, 1, 10, 20, 23, 37, 31, 61, 20, 41, 32, 100]

In [127]:
# 1<ages<=20의 등식이 된다.
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, NaN, 미성년자, 미성년자, 청년, ..., 장년, 미성년자, 중년, 중년, 노년]
Length: 12
Categories (5, object): [미성년자 < 청년 < 중년 < 장년 < 노년]

In [128]:
# Categorical(범주형 변수)
#  age_cat 열값은 문자열이 아니기때문에 astype 메서드를 사용해야한다.
type(cats)

pandas.core.arrays.categorical.Categorical

In [129]:
cats.categories

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

In [130]:
cats.codes

array([-1, -1,  0,  0,  1,  2,  2,  3,  0,  2,  2,  4], dtype=int8)

In [131]:
df4 = pd.DataFrame(ages, columns=["ages"])
df4["age_cat"] = pd.cut(df4.ages, bins, labels=labels)
df4

    ages age_cat
0      0     NaN
1      1     NaN
2     10    미성년자
3     20    미성년자
4     23      청년
5     37      중년
6     31      중년
7     61      장년
8     20    미성년자
9     41      중년
10    32      중년
11   100      노년

In [132]:
df4.age_cat.astype(str) + df4.ages.astype(str)

0       nan0
1       nan1
2     미성년자10
3     미성년자20
4       청년23
5       중년37
6       중년31
7       장년61
8     미성년자20
9       중년41
10      중년32
11     노년100
dtype: object

In [133]:
# qcut 명령은 구간 경계선을 지정하지 않고 데이터 갯수가 같도록 지정한 수의 구간으로 나눈다.
# ex. 1000을 4구간으로 나눈다면 250씩 나뉘게된다.
data = np.random.randn(1000)
cats = pd.qcut(data, 4, labels=["Q1", "Q2", "Q3", "Q4"])
cats

[Q2, Q1, Q4, Q2, Q3, ..., Q1, Q3, Q3, Q1, Q2]
Length: 1000
Categories (4, object): [Q1 < Q2 < Q3 < Q4]

In [134]:
pd.value_counts(cats)

Q4    250
Q3    250
Q2    250
Q1    250
dtype: int64

In [136]:
cats.value_counts()

Q1    250
Q2    250
Q3    250
Q4    250
dtype: int64

In [146]:
titanic = sns.load_dataset("titanic")

In [167]:
# 연습 문제 4.4.7
# 타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나눈다.
# 그리고 각 나이 그룹의 승객 비율을 구한다. 비율의 전체 합은 1이 되어야 한다. == 해야함

bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
t2 = titanic.groupby(pd.cut(titanic.age, bins, labels=labels)).size()
t2

age
미성년자    165
청년      230
중년      241
장년       59
노년        5
dtype: int64

In [148]:
# 연습 문제 4.4.8
# 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category3 열을 만들어라. category3 카테고리는 다음과 같이 정의된다.
# 20살 미만이면 성별에 관계없이 “미성년자”라고 한다.
# 20살 이상이면 나이에 따라 “청년”, “중년”, “장년”, “노년”을 구분하고 그 뒤에 성별을 나타내는 “남성”, “여성”을 붙인다.

미성년자    165
청년      230
중년      241
장년       59
노년        5
Name: age, dtype: int64

In [181]:
titanic = sns.load_dataset("titanic")
bins = [0, 20, 30, 50, 70, 100]
t3 = pd.cut(titanic.age, bins, labels=labels)
#labels = ["미성년자", "청년", "중년", "장년", "노년"]
#titanic["category3"] = titanic.apply(lambda r:  if r.age >= 20 else #"미성년자", axis=1)
#titanic.tail()
t3

0        청년
1        중년
2        청년
3        중년
4        중년
       ...
886      청년
887    미성년자
888     NaN
889      청년
890      중년
Name: age, Length: 891, dtype: category
Categories (5, object): [미성년자 < 청년 < 중년 < 장년 < 노년]